art_share_project/app/controllers/artworks_controller.rb

  def index
    # if params.has_key?(:username)
    #   @user = User.find(params[:username])
    #   render json: @user
    # else
      @artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"

  def destroy
    @artwork = Artwork.find_by(id: params[:id])
    if @artwork.destroy
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 2]]

  def update
    @artwork = Artwork.find(params[:id])

    if @artwork.update(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "XYZ"], ["updated_at", "2023-01-12 01:06:42.259167"], ["id", 3]]