art_share_project/app/controllers/artworks_controller.rb

  def show
    @artwork = Artwork.find_by(id: params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]