art_share_project/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "commenter_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "yet another commenter"], ["commenter_id", 1], ["artwork_id", 2], ["created_at", "2023-01-12 18:19:09.836688"], ["updated_at", "2023-01-12 18:19:09.836688"]]
---
  def create
    @comment = Comment.new(comment_params)
    # @comment.commenter_id = params[:commenter_id]
    if @comment.save!