art_share_project/app/controllers/users_controller.rb

  def index
    if params[:username]
      @user = User.find_by('username ~ ?', params[:username])
      return render json: @user
    else
      @users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Eric"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save!
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Fred"], ["created_at", "2023-01-12 00:39:50.953660"], ["updated_at", "2023-01-12 00:39:50.953660"]]

  def destroy
    @user = User.find_by(params[:id])
---
SELECT "users".* FROM "users" WHERE (1) LIMIT $1  [["LIMIT", 1]]