art_share_project/app/models/artwork.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def self.artworks_for_user_id(user_id)
    # debugger
    @artworks = User.find_by(id: user_id).artworks + User.find_by(id: user_id).shared_artwork