art_share_project/app/models/comment.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def self.comments_for_artwork(artwork_id)
    Artwork.find_by(id: artwork_id).comments

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def self.comments_for_commenter(commenter_id)
    User.find_by(id: commenter_id).comments