first_routes_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # render plain: "I'm in the index action!"
      @users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "bob"], ["email", "bob@bob.com"], ["created_at", "2023-01-11 23:08:58.309891"], ["updated_at", "2023-01-11 23:08:58.309891"]]
---
    def create
      # debugger
      @user = User.new(user_params)
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
      @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
    def destroy
      @user = User.find(params[:id])
      @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "eric"], ["updated_at", "2023-01-11 23:14:13.699465"], ["id", 2]]
---
    def update
      @user = User.find(params[:id])

      if @user.update(user_params)